; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj9 - airport
	obj1 obj10 - city
	obj2 obj11 - airplane
	obj3 obj5 obj7 obj8 obj14 obj15 obj16 - package
	obj4 obj13 - location
	obj6 obj12 - truck
)

(:init
	(at obj11 obj9)
	(at obj12 obj9)
	(at obj16 obj0)
	(at obj5 obj4)
	(at obj6 obj0)
	(at obj7 obj0)
	(at obj3 obj0)
	(in-city obj9 obj10)
	(at obj14 obj13)
	(at obj8 obj4)
	(at obj15 obj4)
	(at obj2 obj0)
	(in-city obj13 obj1)
	(in-city obj4 obj1)
	(in-city obj0 obj1)
)

(:goal (and
	(at obj8 obj9)
	(at obj7 obj9)
	(at obj3 obj9)
	(at obj14 obj9)
	(at obj15 obj9)
	(at obj16 obj9)
	(at obj5 obj9)
))
)

; plan
1. (load obj2 obj7 obj0)
   deleted: (at obj7 obj0)
   added: (in obj7 obj2)
   goals met: 0 of 7
2. (load obj2 obj3 obj0)
   deleted: (at obj3 obj0)
   added: (in obj3 obj2)
   goals met: 0 of 7
3. (load obj2 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj2)
   goals met: 0 of 7
4. (drive obj6 obj0 obj13)
   deleted: (at obj6 obj0)
   added: (at obj6 obj13)
   goals met: 0 of 7
5. (load obj6 obj14 obj13)
   deleted: (at obj14 obj13)
   added: (in obj14 obj6)
   goals met: 0 of 7
6. (drive obj6 obj13 obj0)
   deleted: (at obj6 obj13)
   added: (at obj6 obj0)
   goals met: 0 of 7
7. (unload obj6 obj14 obj0)
   deleted: (in obj14 obj6)
   added: (at obj14 obj0)
   goals met: 0 of 7
8. (load obj2 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj2)
   goals met: 0 of 7
9. (drive obj6 obj0 obj4)
   deleted: (at obj6 obj0)
   added: (at obj6 obj4)
   goals met: 0 of 7
10. (load obj6 obj8 obj4)
   deleted: (at obj8 obj4)
   added: (in obj8 obj6)
   goals met: 0 of 7
11. (load obj6 obj5 obj4)
   deleted: (at obj5 obj4)
   added: (in obj5 obj6)
   goals met: 0 of 7
12. (load obj6 obj15 obj4)
   deleted: (at obj15 obj4)
   added: (in obj15 obj6)
   goals met: 0 of 7
13. (drive obj6 obj4 obj0)
   deleted: (at obj6 obj4)
   added: (at obj6 obj0)
   goals met: 0 of 7
14. (unload obj6 obj8 obj0)
   deleted: (in obj8 obj6)
   added: (at obj8 obj0)
   goals met: 0 of 7
15. (unload obj6 obj5 obj0)
   deleted: (in obj5 obj6)
   added: (at obj5 obj0)
   goals met: 0 of 7
16. (unload obj6 obj15 obj0)
   deleted: (in obj15 obj6)
   added: (at obj15 obj0)
   goals met: 0 of 7
17. (load obj2 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj2)
   goals met: 0 of 7
18. (load obj2 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj2)
   goals met: 0 of 7
19. (load obj2 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj2)
   goals met: 0 of 7
20. (fly obj2 obj0 obj9)
   deleted: (at obj2 obj0)
   added: (at obj2 obj9)
   goals met: 0 of 7
21. (unload obj2 obj8 obj9)
   deleted: (in obj8 obj2)
   added: (at obj8 obj9)
   goals met: 1 of 7
22. (unload obj2 obj7 obj9)
   deleted: (in obj7 obj2)
   added: (at obj7 obj9)
   goals met: 2 of 7
23. (unload obj2 obj5 obj9)
   deleted: (in obj5 obj2)
   added: (at obj5 obj9)
   goals met: 3 of 7
24. (unload obj2 obj3 obj9)
   deleted: (in obj3 obj2)
   added: (at obj3 obj9)
   goals met: 4 of 7
25. (unload obj2 obj16 obj9)
   deleted: (in obj16 obj2)
   added: (at obj16 obj9)
   goals met: 5 of 7
26. (unload obj2 obj15 obj9)
   deleted: (in obj15 obj2)
   added: (at obj15 obj9)
   goals met: 6 of 7
27. (unload obj2 obj14 obj9)
   deleted: (in obj14 obj2)
   added: (at obj14 obj9)
   goals met: 7 of 7
